# file Read Write operation

In [1]:
import numpy as np
import pandas as pd

In [2]:
import pandas as pd

draft1 = pd.read_csv('ex1.csv')    # Supply the file name (path)

draft1.head(4)

   a   b   c   d mesage
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [5]:
draft1.rename(columns={'mesage':'text'})

   a   b   c   d   text
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [4]:
draft2 = pd.read_table('test.tsv')  # Read a tsv into a DataFrame

draft2.head()

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

In [5]:
df = pd.read_csv('ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
pd.read_table('ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
pd.read_csv('ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [9]:
df =pd.read_csv('ex2.csv', names=['asdfdsfs','fsdf', 'b', 'c', 'sudh', 'message'])
type(df)

pandas.core.frame.DataFrame

In [11]:

parsed = pd.read_csv('csv_mindex.csv',
                     index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [12]:

pd.read_csv('ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:

pd.read_csv('ex4.csv', skiprows=[1, 2, 3])

           # hey!
1 2  3  4   hello
5 6  7  8   world
9 10 11 12    foo

In [14]:

result = pd.read_csv('ex5.csv')
result
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [15]:
result = pd.read_csv('E:\ineuron\code_pandas1\examples/ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [16]:
draft3 = pd.read_excel('E:\DataScience-Department-bhc\DS.xlsx') # Name of sheet to read from

draft3.head(6)

,ROLL NO,NAME,UG COLLEGE,CASTE,RELIGIOUS,CONTACT NO,MAIL-ID
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,195229104,DEVA DHARSHINI R,JAMAL MOHAMED COLLEGE-TRICHY,BC,HINDU,9.524578e+09,ds195229104@bhc.edu.in
2,195229105,GNANAEBISTON T,NATIONAL COLLEGE-TRICHY,BC,CHRISTIAN,9.751200e+09,ds195229105@bhc.edu.in
3,195229106,HARINARAYANAN B.M,MIET ARTS AND SCIENCE COLLEGE-TRICHY,BC,HINDU,9.976205e+09,ds195229106@bhc.edu.in
4,195229107,HARIHARAN M,BISHOP HEBER COLLEGE-TRICHY,OC,HINDU,7.010545e+09,ds195229107@bhc.edu.in
5,195229108,ISAAC RAJA S,ST.JOHN'S COLLEGE-PALAYAMKOTTAI,BC,CHRISTIAN,8.148887e+09,ds195229108@bhc.edu.in

In [18]:
url = "https://www.basketball-reference.com/leagues/NBA_2015_totals.html"

BB_data = pd.read_html(url)         # Read data from the specified url

BB_data[0].ix[:, 0:20].head(5)      # Check 5 rows (10 columns only)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:5: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,FG%,3P,3PA,3P%,2P,2PA,2P%,eFG%,FT,FTA
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,.459,18,60,.300,134,271,.494,.486,76,97
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,.407,10,25,.400,25,61,.410,.465,14,23
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,.544,0,2,.000,217,397,.547,.544,103,205
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,.432,0,0,NaN,19,44,.432,.432,22,38
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,.424,118,333,.354,257,551,.466,.491,167,198

In [19]:
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')

In [20]:
titanic_train.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [21]:
titanic_train[["Name","Pclass"]].head()

                                                Name  Pclass
0                            Braund, Mr. Owen Harris       3
1  Cumings, Mrs. John Bradley (Florence Briggs Th...       1
2                             Heikkinen, Miss. Laina       3
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)       1
4                           Allen, Mr. William Henry       3

In [22]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [23]:
pd.options.display.max_rows = 10

In [24]:
result = pd.read_csv('ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [25]:
pd.read_csv('ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [26]:
chunk = pd.read_csv('ex6.csv', chunksize=1000)
chunk

Writing Data to Text Format

In [27]:
data = pd.read_csv('E:\ineuron\code_pandas1\examples/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [28]:
data.to_csv('E:\ineuron\code_pandas1\out1.csv')

In [30]:
df=pd.read_csv('E:\ineuron\code_pandas1\out1.csv')
df.head()

   Unnamed: 0 something  a   b     c   d message
0           0       one  1   2   3.0   4     NaN
1           1       two  5   6   NaN   8   world
2           2     three  9  10  11.0  12     foo

In [31]:
import sys
data.to_csv('E:\ineuron\code_pandas1\examples\out.csv',sep='@')

In [32]:
df=pd.read_csv('out.csv')
df.head()

   Unnamed: 0 something  a   b     c   d message
0           0       one  1   2   3.0   4     NaN
1           1       two  5   6   NaN   8   world
2           2     three  9  10  11.0  12     foo

In [33]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [34]:
data.to_csv('E:\ineuron\code_pandas1\out.csv', index=False, header=None)

In [35]:
df=pd.read_csv('out.csv')
df

   Unnamed: 0 something  a   b     c   d message
0           0       one  1   2   3.0   4     NaN
1           1       two  5   6   NaN   8   world
2           2     three  9  10  11.0  12     foo

In [36]:
data.to_csv('E:\ineuron\code_pandas1\out.csv', index=False, columns=['a', 'b', 'c'])

In [37]:
df=pd.read_csv('out.csv')
df

   Unnamed: 0 something  a   b     c   d message
0           0       one  1   2   3.0   4     NaN
1           1       two  5   6   NaN   8   world
2           2     three  9  10  11.0  12     foo

In [38]:
dates = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7), index=dates)
ts.to_csv('E:\\ineuron\\code_pandas1\\tseries.csv')

In [39]:
df=pd.read_csv('E:\\ineuron\\code_pandas1\\tseries.csv')
df

   2000-01-01  0
0  2000-01-02  1
1  2000-01-03  2
2  2000-01-04  3
3  2000-01-05  4
4  2000-01-06  5
5  2000-01-07  6

Working with Delimited Formats

In [40]:
import csv
f = open('E:\\ineuron\\code_pandas1\\examples\\ex7.csv')

reader = csv.reader(f)
reader

In [41]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [42]:
with open('E:\\ineuron\\code_pandas1\\examples\\ex7.csv') as f:
    lines = list(csv.reader(f))

In [43]:
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [44]:
header, values = lines[0], lines[1:]

In [45]:
lines[0]

['a', 'b', 'c']

In [46]:
lines[1:]

[['1', '2', '3'], ['1', '2', '3']]

In [47]:
data_dict={h:v for h,v in zip(header,zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

JSON Data

In [49]:
obj = """
{"name": "surya",
 "places_lived": ["Trichy", "Namakkal", "Karur"],
 "pet": null,
 "siblings": [{"name": "Gayu", "age": 24, "pets": ["Juli"]},
              {"name": "Swetha", "age": 21,
               "pets": ["Sixes", "Stache", "Cisco"]}]}

"""

In [50]:
import json
result = json.loads(obj)
result

{'name': 'surya',
 'places_lived': ['Trichy', 'Namakkal', 'Karur'],
 'pet': None,
 'siblings': [{'name': 'Gayu', 'age': 24, 'pets': ['Juli']},
  {'name': 'Swetha', 'age': 21, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [51]:
asjson = json.dumps(result)

In [52]:
asjson

'{"name": "surya", "places_lived": ["Trichy", "Namakkal", "Karur"], "pet": null, "siblings": [{"name": "Gayu", "age": 24, "pets": ["Juli"]}, {"name": "Swetha", "age": 21, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [53]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age','pets'])
siblings

     name  age                    pets
0    Gayu   24                  [Juli]
1  Swetha   21  [Sixes, Stache, Cisco]

In [54]:
data = pd.read_json('E:\\ineuron\\code_pandas1\\examples\\example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [55]:
print(data.to_json())
print(data.to_json(orient='records'))

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}
[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [56]:
df = pd.DataFrame([['a', 'b'], ['c', 'd']],
                  index=['row 1', 'row 2'],
                  columns=['col 1', 'col 2'])

In [57]:
df

      col 1 col 2
row 1     a     b
row 2     c     d

In [58]:
df.to_json(orient='split')

'{"columns":["col 1","col 2"],"index":["row 1","row 2"],"data":[["a","b"],["c","d"]]}'

In [60]:
df.to_json(orient='columns')

'{"col 1":{"row 1":"a","row 2":"c"},"col 2":{"row 1":"b","row 2":"d"}}'

In [61]:
df.to_json(orient='index')

'{"row 1":{"col 1":"a","col 2":"b"},"row 2":{"col 1":"c","col 2":"d"}}'

In [62]:
df.to_json(orient='records')

'[{"col 1":"a","col 2":"b"},{"col 1":"c","col 2":"d"}]'

In [63]:
df.to_json(orient='values')

'[["a","b"],["c","d"]]'

In [65]:
df.to_json(orient='table')

'{"schema": {"fields":[{"name":"index","type":"string"},{"name":"col 1","type":"string"},{"name":"col 2","type":"string"}],"primaryKey":["index"],"pandas_version":"0.20.0"}, "data": [{"index":"row 1","col 1":"a","col 2":"b"},{"index":"row 2","col 1":"c","col 2":"d"}]}'

XML and HTML: Web Scraping

In [126]:
tables = pd.read_html('/Users/sudhanshukumar/Downloads/examples/fdic_failed_bank_list.html')
len(tables)
failures = tables[0]
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [129]:
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts()
#close_timestamps

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

# Binary Data Formats

In [66]:
frame = pd.read_csv('E:\\ineuron\\code_pandas1\\examples\\example.json')
frame
frame.to_pickle('E:\\ineuron\\code_pandas1\\examples\\frame_pickle')

In [67]:
frame

   [{"a": 1   "b": 2    "c": 3}  Unnamed: 3
0   {"a": 4   "b": 5    "c": 6}         NaN
1   {"a": 7   "b": 8   "c": 9}]         NaN

In [68]:
pd.read_pickle('E:\\ineuron\\code_pandas1\\examples\\frame_pickle')

   [{"a": 1   "b": 2    "c": 3}  Unnamed: 3
0   {"a": 4   "b": 5    "c": 6}         NaN
1   {"a": 7   "b": 8   "c": 9}]         NaN

# Web APIs

In [71]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [72]:
data = resp.json()
data[2]['user']

{'login': 'arw2019',
 'id': 48889395,
 'node_id': 'MDQ6VXNlcjQ4ODg5Mzk1',
 'avatar_url': 'https://avatars0.githubusercontent.com/u/48889395?v=4',
 'gravatar_id': '',
 'url': 'https://api.github.com/users/arw2019',
 'html_url': 'https://github.com/arw2019',
 'followers_url': 'https://api.github.com/users/arw2019/followers',
 'following_url': 'https://api.github.com/users/arw2019/following{/other_user}',
 'gists_url': 'https://api.github.com/users/arw2019/gists{/gist_id}',
 'starred_url': 'https://api.github.com/users/arw2019/starred{/owner}{/repo}',
 'subscriptions_url': 'https://api.github.com/users/arw2019/subscriptions',
 'organizations_url': 'https://api.github.com/users/arw2019/orgs',
 'repos_url': 'https://api.github.com/users/arw2019/repos',
 'events_url': 'https://api.github.com/users/arw2019/events{/privacy}',
 'received_events_url': 'https://api.github.com/users/arw2019/received_events',
 'type': 'User',
 'site_admin': False}

In [73]:
issues = pd.DataFrame(data, columns=['number', 'title',
                                     'labels', 'state'])
issues

,number,title,labels,state
0,36657,CLN: More pytest idioms in pandas/tests/window,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
1,36656,ASV: used integer list as indexer for Series.t...,[],open
2,36655,BUG: DataFrame.pivot drops column level names ...,[],open
3,36654,CLN: dont special-case DatetimeArray indexing,[],open
4,36653,CLN: de-duplicate IntervalArray validators,[],open
...,...,...,...,...
25,36622,Comment on stale PRs,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
26,36621,BUG: isin - dtype conversions (Timestamp vs ints),"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
27,36618,CLN: Break up aggregate.transform,"[{'id': 697792067, 'node_id': 'MDU6TGFiZWw2OTc...",open
28,36617,DOC: Replace single with double backticks in R...,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
29,36615,BUG: OutOfBoundsTimedelta not raised for out-o...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open

# Interacting with Databases

In [75]:
import sqlite3
#connecting with the database.
db = sqlite3.connect("my_database4.db")
# Drop table if it already exist using execute() method.
db.execute("drop table if exists test")
query = """
CREATE TABLE tests
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""
con = sqlite3.connect('mydata2.sqlite')
con.execute(query)
con.commit()

In [76]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [77]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5),
 ('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [78]:
cursor.description
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5
3      Atlanta     Georgia  1.25  6
4  Tallahassee     Florida  2.60  3
5   Sacramento  California  1.70  5

In [79]:
#!/usr/bin/python

import sqlite3
#connecting with the database.
db = sqlite3.connect("my_database5.db")
# Drop table if it already exist using execute() method.
db.execute("drop table if exists grades1")
# Create table as per requirement
db.execute("create table grades1(id int, name text, score int)")
#inserting values inside the created table
db.execute("insert into grades1(id, name, score) values(101, 'John',99 )")
db.execute("insert into grades1(id, name, score) values(102, 'Gary',90 )")
db.execute("insert into grades1(id, name, score) values(103, 'James', 80 )")
db.execute("insert into grades1(id, name, score) values(104, 'Cathy', 85 )")
db.execute("insert into grades1(id, name, score) values(105, 'Kris',95 )")

In [80]:
db.commit()

In [81]:
results = db.execute("select * from grades1 order by id")
for row in results:
    print((row))
print("-" * 60 )

(101, 'John', 99)
(102, 'Gary', 90)
(103, 'James', 80)
(104, 'Cathy', 85)
(105, 'Kris', 95)
------------------------------------------------------------

In [82]:
results = db.execute("select * from grades1 where name = 'Gary' ")
for row in results: print(row)
print("-"* 60 )

(102, 'Gary', 90)
------------------------------------------------------------

In [83]:
results = db.execute("select * from grades1 where score >= 90 ")
for row in results:
    print(row)
print("-" * 60 )

(101, 'John', 99)
(102, 'Gary', 90)
(105, 'Kris', 95)
------------------------------------------------------------

In [84]:
results = db.execute("select name, score from grades1 order by score desc ")
for row in results:
    print(row)
print("-" * 60 )

('John', 99)
('Kris', 95)
('Gary', 90)
('Cathy', 85)
('James', 80)
------------------------------------------------------------

In [85]:
results = db.execute("select name, score from grades1 order by score")
for row in results:
    print(row)
print("-" * 60 )

('James', 80)
('Cathy', 85)
('Gary', 90)
('Kris', 95)
('John', 99)
------------------------------------------------------------

In [86]:
results = db.execute("select name, score from grades1 order by score")
for row in results:
    print(row)

('James', 80)
('Cathy', 85)
('Gary', 90)
('Kris', 95)
('John', 99)